<a href="https://colab.research.google.com/github/Sudeepthi13/PDS/blob/main/Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.22.4 in /usr/local/lib/python3.10/dist-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd
data = pd.read_csv('/content/train.csv')

# a) Look for the missing values in all the columns and either impute them (replace with mean, median, or mode) or drop them.

In [21]:
# Ensure all values are strings before removing units
data['Mileage'] = data['Mileage'].fillna(data['Mileage'].mean())      # Replace with mean
data['Engine'] = data['Engine'].fillna(data['Engine'].mean())         # Replace with mean
data['Power'] = data['Power'].fillna(data['Power'].mean())            # Replace with mean
data['Seats'] = data['Seats'].fillna(data['Seats'].mode()[0])         # Replace with mode


# Check for missing values again
print(data.isnull().sum())

# Impute or drop missing values without using inplace=True
data['Mileage'] = data['Mileage'].fillna(data['Mileage'].mean())      # Replace with mean
data['Engine'] = data['Engine'].fillna(data['Engine'].mean())         # Replace with mean
data['Power'] = data['Power'].fillna(data['Power'].mean())            # Replace with mean
data['Seats'] = data['Seats'].fillna(data['Seats'].mode()[0])         # Replace with mode

# Drop 'New_Price' column only if it exists
if 'New_Price' in data.columns:
    data.drop(columns=['New_Price'], inplace=True)

Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
Price                0
dtype: int64

#b)Remove the units from some of the attributes and only keep the numerical values.

In [24]:
# Convert all entries to strings before removing units and converting to numeric
data['Mileage'] = pd.to_numeric(data['Mileage'].astype(str).str.replace(' kmpl', ''), errors='coerce')
data['Engine'] = pd.to_numeric(data['Engine'].astype(str).str.replace(' CC', ''), errors='coerce')
data['Power'] = pd.to_numeric(data['Power'].astype(str).str.replace(' bhp', ''), errors='coerce')

# Optional: Convert 'New_Price' if it exists and is needed
if 'New_Price' in data.columns:
    data['New_Price'] = pd.to_numeric(data['New_Price'].astype(str).str.replace(' lakh', ''), errors='coerce')

#C) Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.

In [25]:
# Convert categorical variables to one-hot encoded values
data = pd.get_dummies(data, columns=['Fuel_Type', 'Transmission'], drop_first=True)

#d) Create one more feature and add this column to the dataset (you can use mutate function in R for this).For example, you can calculate the current age of the car by subtracting “Year” value from the current year.

In [26]:
# Add a new feature for the current age of the car
current_year = 2024  # Replace with the current year as needed
data['Car_Age'] = current_year - data['Year']

#e)Perform select, filter, rename, mutate, arrange and summarize with group by operations (or their equivalent operations in python) on this dataset.

In [27]:
# Selecting specific columns: for example, selecting Name, Location, and Price
selected_data = data[['Name', 'Location', 'Price']]
print(selected_data.head())

                               Name    Location  Price
0  Hyundai Creta 1.6 CRDi SX Option        Pune  12.50
1                      Honda Jazz V     Chennai   4.50
2                 Maruti Ertiga VDI     Chennai   6.00
3   Audi A4 New 2.0 TDI Multitronic  Coimbatore  17.74
4            Nissan Micra Diesel XV      Jaipur   3.50

In [28]:
# Filtering data: for example, selecting cars priced above 5 lakhs
filtered_data = data[data['Price'] > 5]
print(filtered_data.head())

   Unnamed: 0                                 Name    Location  Year  \
0           1     Hyundai Creta 1.6 CRDi SX Option        Pune  2015
2           3                    Maruti Ertiga VDI     Chennai  2012
3           4      Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
5           7    Toyota Innova Crysta 2.8 GX AT 8S      Mumbai  2016
6           8  Volkswagen Vento Diesel Comfortline        Pune  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  Price  \
0              41000      First    19.67  1582.0  126.20    5.0  12.50
2              87000      First    20.77  1248.0   88.76    7.0   6.00
3              40670     Second    15.20  1968.0  140.80    5.0  17.74
5              36000      First    11.36  2755.0  171.50    8.0  17.50
6              64430      First    20.54  1598.0  103.60    5.0   5.20

   Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  Car_Age
0               False             False                 True        9
2               False             False                 True       12
3               False             False                False       11
5               False             False                False        8
6               False             False                 True       11

In [29]:
# Renaming columns: for example, renaming 'Kilometers_Driven' to 'Odometer' and 'Owner_Type' to 'Owner'
renamed_data = data.rename(columns={'Kilometers_Driven': 'Odometer', 'Owner_Type': 'Owner'})
print(renamed_data.head())

   Unnamed: 0                              Name    Location  Year  Odometer  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015     41000
1           2                      Honda Jazz V     Chennai  2011     46000
2           3                 Maruti Ertiga VDI     Chennai  2012     87000
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013     40670
4           6            Nissan Micra Diesel XV      Jaipur  2013     86999

    Owner   Mileage  Engine   Power  Seats  Price  Fuel_Type_Electric  \
0   First  19.67000  1582.0  126.20    5.0  12.50               False
1   First  18.16115  1199.0   88.70    5.0   4.50               False
2   First  20.77000  1248.0   88.76    7.0   6.00               False
3  Second  15.20000  1968.0  140.80    5.0  17.74               False
4   First  23.08000  1461.0   63.10    5.0   3.50               False

   Fuel_Type_Petrol  Transmission_Manual  Car_Age
0             False                 True        9
1              True                 True       13
2             False                 True       12
3             False                False       11
4             False                 True       11

In [30]:
# Creating a new column: for example, calculating car age based on the Year column
current_year = 2024  # Update to the current year if needed
data['Car_Age'] = current_year - data['Year']

# Example of modifying a column or creating a derived metric, e.g., price per age of the car
data['Price_Per_Age'] = data['Price'] / data['Car_Age']
print(data[['Car_Age', 'Price_Per_Age']].head())

   Car_Age  Price_Per_Age
0        9       1.388889
1       13       0.346154
2       12       0.500000
3       11       1.612727
4       11       0.318182

In [31]:
# Sorting data by Price in descending order
sorted_data = data.sort_values(by='Price', ascending=False)
print(sorted_data.head())

      Unnamed: 0                                         Name    Location  \
3952        4079  Land Rover Range Rover 3.0 Diesel LWB Vogue   Hyderabad
5620        5781                   Lamborghini Gallardo Coupe       Delhi
5752        5919                       Jaguar F Type 5.0 V8 S   Hyderabad
1457        1505              Land Rover Range Rover Sport SE       Kochi
1917        1974                           BMW 7 Series 740Li  Coimbatore

      Year  Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  \
3952  2017              25000      First    13.33  2993.0  255.0    5.0
5620  2011               6500      Third     6.40  5204.0  560.0    2.0
5752  2015               8000      First    12.50  5000.0  488.1    2.0
1457  2019              26013      First    12.65  2993.0  255.0    5.0
1917  2018              28060      First    12.05  2979.0  320.0    5.0

       Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  \
3952  160.00               False             False                False
5620  120.00               False              True                False
5752  100.00               False              True                False
1457   97.07               False             False                False
1917   93.67               False              True                False

      Car_Age  Price_Per_Age
3952        7      22.857143
5620       13       9.230769
5752        9      11.111111
1457        5      19.414000
1917        6      15.611667

In [32]:
# Grouping by Location and calculating the average price in each location
summary = data.groupby('Location')['Price'].mean().reset_index().rename(columns={'Price': 'Average_Price'})
print(summary.head())

     Location  Average_Price
0   Ahmedabad       8.567248
1   Bangalore      13.482670
2     Chennai       7.958340
3  Coimbatore      15.160206
4       Delhi       9.881944